src/Catalogs/ar_Диалоги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ar_Диалоги</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ar_Якорь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Провайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ar_LLMПровайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_БезАгента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ПользовательUUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Создан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Обновлён</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ПоследнийЗапуск</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Предмет</Name>					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ПредставлениеПредмета</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ВидДиалога</Name>					<Type>
						<v8:Type>cfg:EnumRef.ar_ВидыДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Состояние</Name>					<Type>
						<v8:Type>cfg:EnumRef.ar_СостоянияДиалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Запуск</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_Инициатор</Name>					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ОткрытыйВопрос</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ДатаВопроса</Name>					<Comment/><Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ar_ОтветитьДо</Name>					<Comment/><Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ar_ВыбранныеИнструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ar_Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ar_Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ar_Пользователь</Name>							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_Основание</Name>							<Type>
								<v8:Type>cfg:EnumRef.ar_ОснованияУчастияВДиалоге</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ar_АдресПочты</Name>							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ar_СостоянияДиалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ar_СостоянияДиалогов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершён</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Истёк</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ar_ВидыДиалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ar_ВидыДиалогов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Чат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВопросыАгента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ar_Диалоги/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Форма элемента справочника ar_Диалоги (agentrunner-26 п.16): лента через
// ядро ar_ДиалогиСервер, ответ на открытый вопрос либо сообщение в завершённый
// диалог, переход к предмету. Реквизиты диалога в форме не редактируются.
// Доступ к данным - только через ar_ДиалогиСервер (проверка прав в ядре).
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	ЗагрузитьЛенту();
	НастроитьВводОтвета();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьСообщение(Команда)

	Если ПустаяСтрока(ТекстОтвета) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Введите текст сообщения.'; en='Enter the message text.'"));
		Возврат;
	КонецЕсли;

	СообщениеИтога = "";

	Если ОтправитьНаСервере(СообщениеИтога) Тогда
		ОбновитьОтображениеДанных();
	КонецЕсли;

	Если Не ПустаяСтрока(СообщениеИтога) Тогда
		ПоказатьПредупреждение(, СообщениеИтога);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКПредмету(Команда)

	Если Не ЗначениеЗаполнено(ПредметДиалога) Тогда
		Возврат;
	КонецЕсли;

	// Переопределение открытия предмета пакетом (agentrunner-50): один
	// серверный вызов на нажатие; нет пакета - открытие как раньше.
	ПараметрыОткрытия = ПараметрыОткрытияПредмета(ПредметДиалога);

	Если ПараметрыОткрытия = Неопределено Тогда
		ПоказатьЗначение(, ПредметДиалога);
	Иначе
		ОткрытьФорму(ПараметрыОткрытия.ИмяФормы, ПараметрыОткрытия.ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры открытия предмета пакетом - через ядро (agentrunner-50); контракт
// и лог - в ar_ДиалогиСервер.ПараметрыОткрытияПредмета. Неопределено -
// предмет открывается штатно (ПоказатьЗначение).
//
&НаСервереБезКонтекста
Функция ПараметрыОткрытияПредмета(Знач Предмет)

	Возврат ar_ДиалогиСервер.ПараметрыОткрытияПредмета(Предмет);

КонецФункции

// Загрузить ленту и предмет диалога (через ядро; доступ проверяет ядро).
//
&НаСервере
Процедура ЗагрузитьЛенту()

	ШапкаДиалога = ar_ДиалогиСервер.ШапкаДиалога(Объект.Ссылка);
	ЛентаHTML = ar_ДиалогиСервер.РазметкаЛентыHTML(Объект.Ссылка);
	ПредметДиалога = ШапкаДиалога.Предмет;

	// Варианты открытого вопроса - в список выбора поля ответа.
	Элементы.ТекстОтвета.СписокВыбора.Очистить();
	Если ШапкаДиалога.Состояние = Перечисления.ar_СостоянияДиалогов.ОжидаетОтвета Тогда
		Варианты = ar_ДиалогиСервер.ВариантыОткрытогоВопроса(Объект.Ссылка);
		Для Каждого Вариант Из Варианты Цикл
			Элементы.ТекстОтвета.СписокВыбора.Добавить(Вариант);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Отправить сообщение (ответ на вопрос либо сообщение в завершённый диалог).
// После отправки лента и шапка обновляются. Текст для пользователя возвращается
// в СообщениеИтога (ПоказатьПредупреждение - клиентский вызов).
//
&НаСервере
Функция ОтправитьНаСервере(СообщениеИтога)

	Итог = ar_ДиалогиСервер.ОтправитьСообщение(Объект.Ссылка, ТекстОтвета);

	СообщениеИтога = Итог.Сообщение;

	Если Итог.Успех Тогда
		ТекстОтвета = "";
		ЗначениеВРеквизитФормы(Объект.Ссылка.ПолучитьОбъект(), "Объект");
	КонецЕсли;

	ЗагрузитьЛенту();
	НастроитьВводОтвета();

	Возврат Итог.Успех;

КонецФункции

// Поле ввода закрыто, когда отправка недопустима (спека п.13), с пояснением.
//
&НаСервере
Процедура НастроитьВводОтвета()

	ШапкаДиалога = ar_ДиалогиСервер.ШапкаДиалога(Объект.Ссылка);
	// Пустой ar_ВидДиалога (диалоги, созданные до задачи) - тоже чат (спека п.2).
	Если ШапкаДиалога.ВидДиалога <> Перечисления.ar_ВидыДиалогов.ВопросыАгента Тогда
		Элементы.ГруппаОтвета.Заголовок = НСтр("ru='Чат ведётся в консоли агентов';
			|en='The chat is handled in the agent console'");
		Элементы.ГруппаОтвета.Доступность = Ложь;
		Возврат;
	КонецЕсли;

	Если ШапкаДиалога.Состояние = Перечисления.ar_СостоянияДиалогов.ВРаботе Тогда
		Элементы.ГруппаОтвета.Заголовок = НСтр("ru='Агент работает, дождитесь ответа';
			|en='The agent is working, please wait for the reply'");
		Элементы.ГруппаОтвета.Доступность = Ложь;
		Возврат;
	КонецЕсли;

	Элементы.ГруппаОтвета.Заголовок = НСтр("ru='Ответ'; en='Reply'");
	Элементы.ГруппаОтвета.Доступность = Истина;

КонецПроцедуры

#КонецОбласти
